# GetFilterOverrides Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
View..::..GetFilterOverrides Method
View Class See Also
---
Gets graphic overrides that a filter applies to the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public OverrideGraphicSettings GetFilterOverrides(
	ElementId filterElementId
)
```

Visual Basic
---
```text
Public Function GetFilterOverrides ( _
	filterElementId As ElementId _
) As OverrideGraphicSettings
```

Visual C++
---
```text
public:
OverrideGraphicSettings^ GetFilterOverrides(
	ElementId^ filterElementId
)
```

# ### Parameters
filterElementId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the filter.
# ### Return Value
Object representing all graphic overrides of the filter in the view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | ElementId is not associated with a FilterElement. -or- Filter is not applied to the view. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | View does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

# See Also
View Class
Autodesk.Revit.DB Namespace